const docsCategory = db.categories.findOne({ "name.be": "Дакументы" })
const booksCategory = db.categories.findOne({ "name.be": "Кнігі" })

const lawCategory = db.categories.findOne({ "name.be": "Права", "parentId": docsCategory._id })
const religionCategory = db.categories.findOne({ "name.be": "Рэлігія", "parentId": booksCategory._id })

const churchSlavonic = db.languages.findOne({ "name.be": "Царкоўнаславянская" })
const oldEastSlavic = db.languages.findOne({ "name.be": "Старажытнаруская" })
const ruthenian = db.languages.findOne({ "name.be": "Старабеларуская" })
const russian = db.languages.findOne({ "name.be": "Руская" })
const belarusian = db.languages.findOne({ "name.be": "Беларуская" })

db.historicalDocs.insertOne({
    "title": {
        "be": "Судзебнік Казіміра 1468 г.",
        "ru": "Судебник Казимира 1468 г."
    },
    "creationTime": {
        "be": "1468 г.",
        "ru": "1468 г."
    },
    "author": {
        "be": "Казімір IV Ягелончык",
        "ru": "Казимир IV Ягеллончик"
    },
    "description": {
        "be": "Судзебнік Казіміра 1468 года — першы вядомы пісьмовы збор законаў Вялікага Княства Літоўскага. Прыняты пры вялікім князі Казіміры IV. Дакумент рэгламентаваў судовыя працэсы, асабліва ў дачыненні да залежных сялян, і замацоўваў нормы феадальнага права. Быў прызначаны для судоў феадалаў, якія ажыццяўлялі правасуддзе над прыгоннымі, усталёўваючы пакаранні за розныя правапарушэнні. Дакумент адлюстроўваў умацаванне ўлады землеўладальнікаў і спрыяў юрыдычнаму афармленню прыгоннага права у ВКЛ.",
        "ru": "Судебник Казимира 1468 года — первый известный письменный свод законов Великого княжества Литовского. Принят при великом князе Казимире IV. Этот документ регулировал судебные процессы, особенно в отношении зависимых крестьян, и закреплял нормы феодального права. Был предназначен для судов феодалов, которые вершили правосудие над крепостными, устанавливая наказания за различные правонарушения. Документ отражал усиление власти землевладельцев и способствовал юридическому оформлению крепостного права в ВКЛ."
    },
    "languageId": ruthenian._id,
    "categoryId": docsCategory._id,
    "subCategoryId": lawCategory._id,
    "fileInstances": [
        {
            "title": "Судебник Казимира 1468 г. (оригинал)",
            "languageId": ruthenian._id,
            "fileId": db.fs.files.findOne({ filename: /Судзебнік_Казіміра_1468_г\.pdf$/i })._id
        }
    ],
    "imageId": db.fs.files.findOne({ filename: /Судзебнік_Казіміра_1468_г\.jpg$/i })._id,
    "tags": []
})

db.historicalDocs.insertOne({
    "title": {
        "be": "Прывілей Казіміра 1447 г.",
        "ru": "Привилей Казимира 1447 г."
    },
    "creationTime": {
        "be": "1447 г.",
        "ru": "1447 г."
    },
    "author": {
        "be": "Казімір IV Ягелончык",
        "ru": "Казимир IV Ягеллончик"
    },
    "description" : {
        "be": "Прывілей Казіміра 1447 года – важны заканадаўчы акт Вялікага Княства Літоўскага, выдадзены вялікім князем Казімірам IV Ягелончыкам. Дакумент пашыраў правы і прывілеі феадальнай знаці (шляхты), замацоўваючы іх палітычныя і эканамічныя свабоды. Прывілей пацвярджаў права шляхты на валоданне зямлёй, абмяжоўваў самавольства вялікага князя ў дачыненні да падданых і ўсталёўваў гарантыі недатыкальнасці маёмасці. Адначасова дакумент спрыяў прыгону сялян, пазбаўляючы іх права свабоднага пераходу паміж землеўладальнікамі. Прывілей 1447 года ўмацаваў становішча шляхты і стаў важным этапам у фармаванні саслоўнай сістэмы ВКЛ.",
        "ru": "Привилей Казимира 1447 года – важный законодательный акт Великого княжества Литовского, изданный великим князем Казимиром IV Ягеллончиком. Этот документ расширял права и привилегии феодальной знати (шляхты), закрепляя их политические и экономические свободы. Привилей подтверждал право шляхты на владение землей, ограничивал произвол великого князя в отношении подданных и устанавливал гарантии неприкосновенности имущества. Одновременно документ способствовал закрепощению крестьян, лишая их права свободного перехода между землевладельцами. Привилей 1447 года укрепил позиции шляхты и стал важным этапом в формировании сословной системы ВКЛ."
    },
    "languageId": ruthenian._id,
    "categoryId": docsCategory._id,
    "subCategoryId": lawCategory._id,
    "fileInstances": [
        {
            "title": "Прывілей Казіміра 1447 г. (арыгінал)",
            "languageId": ruthenian._id,
            "fileId": db.fs.files.findOne({ filename: /Прывілей_Казіміра_1447_г\.pdf$/i })._id
        }
    ],
    "tags": []
})

db.historicalDocs.insertOne({
    "title": {
        "be": "Прывілей Аляксандра 1492 г.",
        "ru": "Привилей Александра 1492 г."
    },
    "creationTime": {
        "be": "1492 г.",
        "ru": "1492 г."
    },
    "author": {
        "be": "Аляксандр IV Ягелончык",
        "ru": "Александр IV Ягеллончик"
    },
    "description" : {
        "be": "Прывілей Аляксандра 1492 года — значны гістарычны дакумент, выдадзены вялікім князем літоўскім Аляксандрам Ягелончыкам. Ён замацоўваў правы і прывілеі шляхты Вялікага Княства Літоўскага, пацвярджаючы іх свабоды і абмяжоўваючы ўладу манарха. Дакумент стаў адным з ключавых крокаў у фарміраванні шляхецкай дэмакратыі і ўмацаванні саслоўных правоў. Прывілей таксама спрыяў збліжэнню Вялікага Княства Літоўскага з Польшчай, што пазней прывяло да стварэння Рэчы Паспалітай. Гэты акт лічыцца важным этапам у развіцці дзяржаўнасці і права на тэрыторыі Беларусі і Літвы.",
        "ru": "Привилей Александра 1492 года — важный исторический документ, изданный великим князем литовским Александром Ягеллончиком. Он закреплял права и привилегии шляхты Великого княжества Литовского, подтверждая их свободы и ограничивая власть монарха. Документ стал одним из ключевых шагов в формировании шляхетской демократии и укреплении сословных прав. Привилей также способствовал сближению Великого княжества Литовского с Польшей, что впоследствии привело к созданию Речи Посполитой. Этот акт считается важным этапом в развитии государственности и права на территории Беларуси и Литвы."
    },
    "languageId": ruthenian._id,
    "categoryId": docsCategory._id,
    "subCategoryId": lawCategory._id,
    "fileInstances": [
        {
            "title": "Прывілей Аляксандра 1492 г. (арыгінал)",
            "languageId": ruthenian._id,
            "fileId": db.fs.files.findOne({ filename: /Прывілей_Аляксандра_1492_г\.pdf$/i })._id
        }
    ],
    "tags": []
})

db.historicalDocs.insertOne({
    "title": {
        "be": "Судзебнік Івана 1497 г.",
        "ru": "Судебник Ивана 1497 г."
    },
    "creationTime": {
        "be": "1497 г.",
        "ru": "1497 г."
    },
    "author": {
        "be": "Іван III Васільевіч",
        "ru": "Иван III Васильевич"
    },
    "description" : {
        "be": "Судзебнік 1497 года — першы збор законаў адзінай Рускай дзяржавы, створаны пры вялікім князі Іване III. Гэты дакумент замацаваў асновы цэнтралізаванай судовай сістэмы і ўніфікаваў прававыя нормы на ўсёй тэрыторыі дзяржавы. Судзебнік рэгуляваў пытанні крымінальнага і грамадзянскага права, устанаўліваў парадак судаводства і пакарання за злачынствы. Ён таксама абмяжоўваў самаўпраўства мясцовых улад, падпарадкаваўшы іх цэнтральнай княжацкай адміністрацыі. Судзебнік 1497 года стаў важным крокам у фармаванні прававой сістэмы Расіі.",
        "ru": "Судебник 1497 года — первый свод законов единого Русского государства, созданный при великом князе Иване III. Этот документ закрепил основы централизованной судебной системы и унифицировал правовые нормы на всей территории государства. Судебник регулировал вопросы уголовного и гражданского права, устанавливал порядок судопроизводства и наказания за преступления. Он также ограничил произвол местных властей, подчинив их центральной княжеской администрации. Судебник 1497 года стал важным шагом в формировании правовой системы России."
    },
    "languageId": oldEastSlavic._id,
    "categoryId": docsCategory._id,
    "subCategoryId": lawCategory._id,
    "fileInstances": [
        {
            "title": "Судебник Ивана 1497 г. (оригинал)",
            "languageId": oldEastSlavic._id,
            "fileId": db.fs.files.findOne({ filename: /Судебник_Ивана_1497_г\._оригинал\.pdf$/i })._id
        },
        {
            "title": "Судебник Ивана 1497 г. (новая редакция)",
            "languageId": russian._id,
            "fileId": db.fs.files.findOne({ filename: /Судебник_Ивана_1497_г\._новая_редакция\.pdf$/i })._id
        }
    ],
    "imageId": db.fs.files.findOne({ filename: /Судебник_Ивана_1497_г\.jpg$/i })._id,
    "tags": []
})

db.historicalDocs.insertOne({
    "title": {
        "be": "Жыціе Кірылы Тураўскага",
        "ru": "Житие Кирилла Туровского"
    },
    "creationTime": {
        "be": "XIV-XV ст.ст.",
        "ru": "XIV-XV в.в."
    },
    "description" : {
        "be": "«Жыціе Кірылы Тураўскага» апісвае духоўны шлях і жыццё епіскапа Кірылы — вядомага пропаведніка і пісьменніка XII стагоддзя. Кірыла праславіўся сваімі казаннямі, малітвамі і павучаннямі, што вылучаюцца глыбінёй думкі і прыгожай літаратурнай мовай. У жыцці падкрэсліваецца ягоная пакора, любоў да Бога і адмаўленне ад зямной славы.",
        "ru": "«Житие Кирилла Туровского» повествует о жизни и духовном пути епископа Кирилла — выдающегося церковного писателя и проповедника XII века. Он прославился своими поучениями, молитвами и речами, отличающимися глубокой богословской мыслью и литературным мастерством. В житии подчеркиваются его смирение, любовь к Богу, а также отказ от мирских почестей."
    },
    "languageId": churchSlavonic._id,
    "categoryId": booksCategory._id,
    "subCategoryId": religionCategory._id,
    "fileInstances": [
        {
            "title": "Житие Кирилла Туровского (оригинал и русский перевод)",
            "languageId": russian._id,
            "fileId": db.fs.files.findOne({ filename: /Житие_Кирилла_Туровского\.pdf$/i })._id
        }
    ],
    "tags": []
})

db.historicalDocs.insertOne({
    "title": {
        "be": "Жыціе Еўфрасінні Полацкай",
        "ru": "Житие Евфросинии Полоцкой"
    },
    "creationTime": {
        "be": "другая палова XII ст.",
        "ru": "вторая половина XII в."
    },
    "description" : {
        "be": "«Жыціе Еўфрасінні Полацкай» апавядае пра жыццё святой князёўны, асветніцы і манашкі XII стагоддзя. Паходзячы са знатнага полацкага роду, яна адмовілася ад шлюбу і пайшла ў манастыр, цалкам прысвяціўшы сябе служэнню Богу. Еўфрасіння займалася асветай, перапісваннем кніг і будаўніцтвам храмаў. Асаблівую славу ёй прынёс заснаваны ёю Спаса-Еўфрасіннеўскі манастыр ды крыж, які стаў духоўным сімвалам Беларусі.",
        "ru": "«Житие Евфросинии Полоцкой» рассказывает о жизни святой княжны, просветительницы и монахини XII века. Родом из знатного полоцкого рода, она отказалась от брака и ушла в монастырь, посвятив себя Богу. Евфросиния занималась просвещением, перепиской книг и строительством храмов. Особую славу ей принёс основанный ею Спасо-Евфросиниевский монастырь и крест, который стал духовным символом Беларуси."
    },
    "languageId": churchSlavonic._id,
    "categoryId": booksCategory._id,
    "subCategoryId": religionCategory._id,
    "fileInstances": [
        {
            "title": "Жыціе Еўфрасінні Полацкай (беларускі пераклад)",
            "languageId": belarusian._id,
            "fileId": db.fs.files.findOne({ filename: /Жыціе_Еўфрасінні_Полацкай\.pdf$/i })._id
        }
    ],
    "imageId": db.fs.files.findOne({ filename: /Жыціе_Еўфрасінні_Полацкай\.jpg$/i })._id,
    "tags": []
})